# Space_CreateSpace

## Description
Creates a new space with the passed polygon

```pascal
FUNCTION Space_CreateSpace(
				space       : HANDLE;
				spaceHeight : REAL) : HANDLE;
```

```python

def vs.Space_CreateSpace(space, spaceHeight):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE||
|spaceHeight|REAL||

## Version
Availability: from Vectorworks 2014
## Category
* SpaceObjectCoreTools